IDEA Open Model
PointOnLine3D.Geometry Property
Compatible with IDEA StatiCa Beta 20.0
 Gets or sets the reference to PolyLine3D line or Segment3D segment.
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public ReferenceElement Geometry { get; set; }
Public Property Geometry As ReferenceElement
	Get
	Set
Property Value
Type: ReferenceElement
See Also
Reference
PointOnLine3D Class
IdeaRS.OpenModel.Geometry3D Namespace